tutorials/ShearStressDriven/successor/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

kappa                0.40;          // (HW:p. 358)
Cmu                  0.09;          // (HW:p. 358)
flowDir              (1 0 0);       // (HW:Fig. 1)
zDir                 (0 0 1);       // (HW:Fig. 1)
Uref                 10.0;          // (HW:Table 1)
Zref                 6.0;           // (HW:Table 1)
z0                   uniform 0.01;  // (HW:Table 1)
d                    uniform 0.0;
    //  (HW:p. 365):
    //  "In addition, as suggested by RH and often ignored by others, a"
    //  "constant shear stress of rho*(u^*)^2 was applied at the top boundary."
    //
    //  u^* ~ Uref*kappa/ln((Zref+z0)/z0)
    //  (HW:Table 1):
    //  Uref = 10 m/s
    //  Zref = 6 m
    //  z0 = 0.01 m
    //  tau = rho*(u^*)^2 = 0.390796574
SS                   (0.390796574 0 0);

omegaInit            0.005;
nutInit              0;
kInit	             0.5;
epsilonInit          0.1;

// ************************************************************************* //
