tutorials/ShearStressDriven/successor/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

 #include      "include/ABLConditions"
 
internalField   uniform $kInit;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
        value           uniform 0;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform $kInit;
    }

    top
    {
        type            zeroGradient;
    }

    sides
    {
        type            empty;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
